; domain
(define (domain serveToast)
  (:requirements :strips :conditional-effects  :equality)

  ;; ───── Constants ────
  ;; Fixed objects in the scene
  (:constants bread egg fridge knife plate pan mug toaster stoveburner coffeemachine dining_table counter_1 counter_2 counter_1_l counter_2_l dining_table_l fridge_l default_l)

    ;; ───── Predicate Definitions ─────
    (:predicates
      (at ?loc)                ; Robot is at a specific location
      (on ?obj ?surf)          ; Object is on a surface or device
      (at-location ?obj ?loc) ; e.g., (at-location fridge fridge_l)
      (in ?obj ?cont)          ; Object is inside a container (like the fridge)
      (holding ?obj)           ; Robot is holding an object
      (hand-empty)             ; Robot's hand is empty
      (is-sliced ?obj)         ; Object has been sliced
      (is-toasted ?obj)        ; Object has been toasted
      (is-on ?device)          ; Device is currently turned on
      (opened ?obj)            ; Container (like the fridge) is open
    )

    ;; ───── Action Definitions ─────
    ;; Move the robot between locations
    (:action move
      :parameters (?from ?to)
      :precondition (and (at ?from) (not (holding knife)))
      :effect (and (not (at ?from)) (at ?to))
    )

    ;; Open a container (e.g., the fridge)
    (:action open
      :parameters (?obj ?loc)
      :precondition (and (at ?loc) (at-location ?obj ?loc) (not (opened ?obj)))
      :effect (opened ?obj)
    )

    ;; Pick up an object
    (:action pick
      :parameters (?obj ?container ?loc)
      :precondition (and (at ?loc) (hand-empty) (at-location ?container ?loc) (at-location ?obj ?loc)
                         (or (and (in ?obj ?container) (opened ?container))
                             (on ?obj ?container)))
      :effect (and (holding ?obj) (not (hand-empty)) (not (at-location ?obj ?loc))
                   (not (in ?obj ?container)) (not (on ?obj ?container)))
    )

    ;; Put down an object
    (:action put
      :parameters (?obj ?container ?loc)
      :precondition (
        and 
        (at ?loc)
        (at-location ?container ?loc) 
        (holding ?obj) 
        (not (at-location ?obj ?loc))
        (not (= ?container knife))  ; <--- PREVENT PUTTING ON KNIFE
        (not (= ?container bread))  ; <--- PREVENT PUTTING ON BREAD 
        (or (not (= ?container toaster)) (is-sliced ?obj))
        )
      :effect (and (not (holding ?obj)) (hand-empty) (on ?obj ?container) (at-location ?obj ?loc))
    )

    (:action slice
      :parameters (?obj ?loc)
      :precondition (
        and (at ?loc)
        (holding knife) 
        (at-location ?obj ?loc) 
        (not (is-sliced ?obj))
        (exists (?s) (and (on ?obj ?s) (at-location ?s ?loc)))
      )
      :effect (is-sliced ?obj)
    )

    ;; Turn on a device (to toast the bread)
    (:action turn_on
      :parameters (?device ?loc)
      :precondition (and (at ?loc) (at-location ?device ?loc) (not (is-on ?device)) (on bread ?device) (or (= ?device toaster) (= ?device coffeemachine)))
      :effect (and (is-on ?device) (is-toasted bread))
    )
    ;; Turn off a device (to toast the bread)
    (:action turn_off
      :parameters (?device ?loc)
      :precondition (and (at ?loc) (at-location ?device ?loc) (is-on ?device) (on bread ?device))
      :effect (and (not (is-on ?device)))
    )
  )

; problem
(define (problem serveToast-totable)
  (:domain serveToast)

  (:init
    (at default_l)
    (hand-empty)

    ;; Define which surfaces are at which locations
    (at-location fridge fridge_l)
    (at-location counter_1 counter_1_l)
    (at-location counter_2 counter_2_l)
    (at-location toaster counter_1_l)
    (at-location knife counter_1_l)
    (at-location dining_table dining_table_l)
    (at-location plate dining_table_l)
    (at-location bread fridge_l)
    
    
    ;; Initial containment
    (in bread fridge)

    (on knife counter_1)
    
    (on toaster counter_1)

    (on plate dining_table)
  )

  (:goal
   (and 
    (on knife counter_1) 
    (is-toasted bread)
    (hand-empty)
    (on bread plate)
    (at-location bread dining_table_l) 
    (opened fridge) 
    (at dining_table_l) 
    (is-sliced bread) 
    (at-location knife counter_1_l) 

   )
  )
)

; plan
1. (move default_l fridge_l)
   deleted: (at default_l)
   added: (at fridge_l)
   goals met: 3 of 9
2. (open fridge fridge_l)
   added: (opened fridge)
   goals met: 4 of 9
3. (pick bread fridge fridge_l)
   deleted: (hand-empty) (at-location bread fridge_l) (in bread fridge)
   added: (holding bread)
   goals met: 3 of 9
4. (move fridge_l counter_1_l)
   deleted: (at fridge_l)
   added: (at counter_1_l)
   goals met: 3 of 9
5. (put bread counter_1 counter_1_l)
   deleted: (holding bread)
   added: (hand-empty) (on bread counter_1) (at-location bread counter_1_l)
   goals met: 4 of 9
6. (pick knife counter_1 counter_1_l)
   deleted: (hand-empty) (at-location knife counter_1_l) (on knife counter_1)
   added: (holding knife)
   goals met: 1 of 9
7. (slice bread counter_1_l)
   added: (is-sliced bread)
   goals met: 2 of 9
8. (put knife counter_1 counter_1_l)
   deleted: (holding knife)
   added: (hand-empty) (on knife counter_1) (at-location knife counter_1_l)
   goals met: 5 of 9
9. (pick bread counter_1 counter_1_l)
   deleted: (hand-empty) (at-location bread counter_1_l) (on bread counter_1)
   added: (holding bread)
   goals met: 4 of 9
10. (put bread toaster counter_1_l)
   deleted: (holding bread)
   added: (hand-empty) (on bread toaster) (at-location bread counter_1_l)
   goals met: 5 of 9
11. (turn_on toaster counter_1_l)
   added: (is-on toaster) (is-toasted bread)
   goals met: 6 of 9
12. (pick bread toaster counter_1_l)
   deleted: (hand-empty) (at-location bread counter_1_l) (on bread toaster)
   added: (holding bread)
   goals met: 5 of 9
13. (move counter_1_l dining_table_l)
   deleted: (at counter_1_l)
   added: (at dining_table_l)
   goals met: 6 of 9
14. (put bread plate dining_table_l)
   deleted: (holding bread)
   added: (hand-empty) (on bread plate) (at-location bread dining_table_l)
   goals met: 9 of 9
